Revit 2027 API
TableSectionData.IsAcceptableParamIdAndCategoryId Method
Overload List
Name | Description
IsAcceptableParamIdAndCategoryId(ElementId, ElementId) |  Identifies if the given parameter id and category id can be assigned to a cell in this table.
IsAcceptableParamIdAndCategoryId(Int32, ElementId, ElementId) |  Identifies if the given parameter id and category id can be assigned to a cell in the given row in this table.
Top
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace